In [1]:
# JSON data

In [54]:
import json
import pandas as pd
import numpy as np
import sqlite3

In [8]:
obj = """ {
    "name": "Wes",
    "places_lived": ["United States", "Spain", "Italy"],
    "pet": null,
    "siblings": [
        {"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
        {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}
    ]
}
"""

result = json.loads(obj)  # convert json object to python object

result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Italy'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [9]:
type(result)

dict

In [10]:
asjson = json.dumps(result)  # convert python object to json
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Italy"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [11]:
type(asjson)

str

In [13]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])
siblings

    name  age
0  Scott   30
1  Katie   38

In [15]:
data = pd.read_json('ex6.json')
data

,name,places_lived,pet,siblings
0,Wes,"[United States, Spain, Italy]",NaN,"[{'name': 'Scott', 'age': 30, 'pets': ['Zeus',..."

In [3]:
#Binary Data Formats : using pickle serialization

In [4]:
frame = pd.read_csv('ex1.csv')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
frame.to_pickle('frame_pickle')

In [6]:
pd.read_pickle('frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [7]:
#HDF5 Format: another binary format: hierarichal data format

In [19]:
frame = pd.DataFrame({'a': np.random.randn(100)})
frame

           a
0   0.156356
1   0.198245
2   0.468614
3  -1.573476
4  -0.107941
..       ...
95 -0.928080
96 -0.556729
97  0.418904
98 -0.976231
99 -1.476737

[100 rows x 1 columns]

In [20]:
store = pd.HDFStore('mydata.h5')
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [21]:
store['obj1'] = frame

In [22]:
store['obj1_col'] = frame['a']

In [23]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [25]:
store['obj1']
store['obj1_col']

0     0.156356
1     0.198245
2     0.468614
3    -1.573476
4    -0.107941
        ...
95   -0.928080
96   -0.556729
97    0.418904
98   -0.976231
99   -1.476737
Name: a, Length: 100, dtype: float64

In [31]:
# storage schema: fixed and table(slower)
store.put('obj2', frame, format='table')
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10  0.840139
11 -0.469953
12  0.063640
13 -1.098296
14 -0.705058
15  1.653944

In [32]:
store.close()

In [37]:
# alternate method
frame.to_hdf('mydata.h5', 'obj3', format='table')

In [38]:
df = pd.DataFrame(np.random.randn(25).reshape((5,5)), columns=['a', 'b', 'c', 'd', 'e'])
df

          a         b         c         d         e
0 -0.761318 -0.185707 -0.256840  1.816907 -0.699611
1  0.130970 -1.446711  1.365277  1.127604  0.109613
2  0.428522 -0.703581 -0.191701  0.684176 -0.744360
3  0.336375  0.108178 -0.683360  0.787401  0.741281
4 -0.166082 -0.475731  0.361354  0.027007  0.039124

In [39]:
store = pd.HDFStore('mydata2.h5')
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata2.h5

In [54]:
store.put('obj', df, format='fixed')

In [55]:
store['obj']

          a         b         c         d         e
0 -0.761318 -0.185707 -0.256840  1.816907 -0.699611
1  0.130970 -1.446711  1.365277  1.127604  0.109613
2  0.428522 -0.703581 -0.191701  0.684176 -0.744360
3  0.336375  0.108178 -0.683360  0.787401  0.741281
4 -0.166082 -0.475731  0.361354  0.027007  0.039124

In [59]:
store['obj_col'] = df[['a', 'b', 'c', 'd', 'e']]

In [60]:
store.close()

In [61]:
# Reading microsoft excels

In [65]:
xlsx = pd.ExcelFile('mydata.xlsx')
xlsx

In [68]:
df = pd.read_excel(xlsx)
df.head(10)

   OrderDate   Region       Rep    Item  Units  UnitCost   Total
0 2019-01-06     East     Jones  Pencil     95      1.99  189.05
1 2019-01-23  Central    Kivell  Binder     50     19.99  999.50
2 2019-02-09  Central   Jardine  Pencil     36      4.99  179.64
3 2019-02-26  Central      Gill     Pen     27     19.99  539.73
4 2019-03-15     West   Sorvino  Pencil     56      2.99  167.44
5 2019-04-01     East     Jones  Binder     60      4.99  299.40
6 2019-04-18  Central   Andrews  Pencil     75      1.99  149.25
7 2019-05-05  Central   Jardine  Pencil     90      4.99  449.10
8 2019-05-22     West  Thompson  Pencil     32      1.99   63.68
9 2019-06-08     East     Jones  Binder     60      8.99  539.40

In [69]:
# to write pandas dataframe into excel file

In [70]:
writer = pd.ExcelWriter('mysaveddata.xlsx')
writer

In [73]:
frame.to_excel(writer)

In [79]:
writer.save()

In [75]:
writer = pd.ExcelWriter('michael.xlsx')
frame.to_excel(writer)
writer.save()

In [76]:
# Interacting with web apis

In [77]:
import requests

In [96]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)
resp

In [98]:
data = resp.json()

In [100]:
data[0]['title']

'BUG: set_levels set wrong order levels for MutiIndex'

In [102]:
issues = pd.DataFrame(data, columns=['number', 'title', 'label', 'state'])
issues

    number                                              title  label state
0    33420  BUG: set_levels set wrong order levels for Mut...    NaN  open
1    33419                pandas 1.0.0 conflict with Anaconda    NaN  open
2    33418  lreshape and wide_to_long documentation (Close...    NaN  open
3    33417          DOC: lreshape and wide_to_long references    NaN  open
4    33416              DOC: Fix EX01 in DataFrame.duplicated    NaN  open
5    33415  WIP: Timestamp/DTA match stdlib tzawareness-co...    NaN  open
6    33414  ENH: Optionally pass dtypes as a dict into jso...    NaN  open
7    33411                                         To numeric    NaN  open
8    33410  BUG: ValueError: buffer source array is read-o...    NaN  open
9    33407   REF: call pandas_dtype up-front in Index.__new__    NaN  open
10   33406              BUG: to_period() freq was not infered    NaN  open
11   33404  BUG: Series.__getitem__ with MultiIndex and le...    NaN  open
12   33403  DOC: Fix heading capitalization in doc/source/...    NaN  open
13   33402                            TST: Parameterize tests    NaN  open
14   33401  BUG: Index.astype does not localize to UTC fir...    NaN  open
15   33400  PERF: dtype-only is_foo_dtype checks (up to 5x...    NaN  open
16   33399  DOC: DatetimeTZDtype astype behavior with Seri...    NaN  open
17   33398  ENH: Support passing compression args to gzip ...    NaN  open
18   33397  CI: pandas warnings in tests about keyword onl...    NaN  open
19   33396             DEPR: Remove aliased Resampler methods    NaN  open
20   33395             BUG: Test failures with CPython master    NaN  open
21   33394  (WIP) CI: Check private function not used acro...    NaN  open
22   33392  BUG/PLT: Multiple plots with different cmap, c...    NaN  open
23   33391                             April 2020 Dev Meeting    NaN  open
24   33389  BUG: when adding multiple plots with different...    NaN  open
25   33388    WIP: ENH: Add numba engine to groupby.aggregate    NaN  open
26   33386   BUG: "nan" as a string instead of missing value.    NaN  open
27   33384              FEATURE: pandas.Series.query() #22347    NaN  open
28   33382  DOC: Fix capitalisation in doc/source/whatsnew...    NaN  open
29   33381        BUG: iloc setting columns not taking effect    NaN  open

In [4]:
# interacting with databases

In [37]:
query = """
    CREATE TABLE test(
        a VARCHAR(20), b VARCHAR(20),
        c REAL, d INTEGER
    );

"""

In [38]:
conn = sqlite3.connect('mydata.sqlite')
conn.execute(query)

In [47]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?);"
conn.execute(stmt,('Kathmandu', 'Chitwan', 1.25,4))

In [48]:
data = [('Chitwan', 'Kathmandu', 1.3,4),
        ('Bhaktapur', 'Lalitpur', 2, 3)]
conn.executemany(stmt, data)

In [49]:
cursor = conn.execute('select * from test')
rows = cursor.fetchall()
rows

[('Kathmandu', 'Chitwan', 1.25, 4),
 ('Kathmandu', 'Chitwan', 1.25, 4),
 ('Kathmandu', 'Chitwan', 1.25, 4),
 ('Chitwan', 'Kathmandu', 1.3, 4),
 ('Bhaktapur', 'Lalitpur', 2.0, 3)]

In [50]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [51]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

           a          b     c  d
0  Kathmandu    Chitwan  1.25  4
1  Kathmandu    Chitwan  1.25  4
2  Kathmandu    Chitwan  1.25  4
3    Chitwan  Kathmandu  1.30  4
4  Bhaktapur   Lalitpur  2.00  3

In [52]:
# ex
query = """
    CREATE TABLE data(
    first_name VARCHAR(30), last_name VARCHAR(30),
    phone INTEGER, email VARCHAR(50));

"""

In [55]:
conn = sqlite3.connect('data.sqlite')
conn.execute(query)

In [57]:
data = [('Suraj', 'Karki', 9345389504, 'suraj@python.com'),
        ('Binish', 'Joshi', 9873849584, 'joshi@python.com'),
        ('Saman', 'Shrestha', 9874839284, 'saman@python.com'),
        ('Rojan', 'Dahal', 9873847859, 'rojan@java.com')]
query = "INSERT INTO data VALUES(?,?,?,?)"
conn.executemany(query, data)

In [59]:
cursor = conn.execute('select * from data')
rows = cursor.fetchall()
rows

[('Suraj', 'Karki', 9345389504, 'suraj@python.com'),
 ('Binish', 'Joshi', 9873849584, 'joshi@python.com'),
 ('Saman', 'Shrestha', 9874839284, 'saman@python.com'),
 ('Rojan', 'Dahal', 9873847859, 'rojan@java.com')]

In [60]:
friends = pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

In [61]:
friends

  first_name last_name       phone             email
0      Suraj     Karki  9345389504  suraj@python.com
1     Binish     Joshi  9873849584  joshi@python.com
2      Saman  Shrestha  9874839284  saman@python.com
3      Rojan     Dahal  9873847859    rojan@java.com